Revit 2027 API
GridSegmentDirection Enumeration
 Specify one of the four adjacent segments to a GridNode. See DividedSurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum GridSegmentDirection
Public Enumeration GridSegmentDirection
public enum class GridSegmentDirection
type GridSegmentDirection
Members
Member name | Value | Description
NegativeU | 1
NegativeV | 3
PositiveU | 0
PositiveV | 2
See Also
Reference
Autodesk.Revit.DB Namespace